Revit 2027 API
ParameterTypeId.FabricationPartDuctWeight Property
 "Duct Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDuctWeight { get; }
Public Shared ReadOnly Property FabricationPartDuctWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDuctWeight {
	ForgeTypeId^ get ();
}
static member FabricationPartDuctWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace